<script setup>
const deliveryInfo = [
  "Ми раді доставити вашу улюблену їжу по всьому Львову – це зручно та смачно!",
  "Замовити ласощі легко: виберіть страву на сайті і підтвердьте замовлення за телефоном +38-(066)-666-6666.",
  "Наші менеджери готові приймати та опрацьовувати ваші замовлення з 11:00 до 22:00.",
  "Вам завжди повідомлять точний час доставки. Якщо у вас змінився графік, ми вас сповістимо.",
  "При замовленні на суму від 1000 грн доставка безкоштовна! Якщо менше – вартість доставки становить лише 50 грн.",
  "Загальну суму замовлення ви завжди можете перевірити у кошику або запитати у нашого менеджера.",
  "Оплата вашого замовлення проста: готівкою або безготівковим платежем через наш термінал, коли кур'єр доставить вашу їжу.",
  "Кур'єр доставить замовлення до вашого під'їзду або багатоквартирного будинку. Занести до квартири - за домовленістю з кур'єром.",
  "Ми цінуємо ваші відгуки та готові вислухати зауваження та пропозиції. Зв'яжіться з нами за телефоном  +38-(066)-666-6666.",
];
</script>
<template>
  <main role="main" class="custom-global-px custom-global-py flex-1">
    <h1 class="text-4xl 2xl:text-6xl mt-8 mb-10 text-center sm:text-start">
      Інформація про доставку
    </h1>
    <div class="flex flex-col gap-6 text-lg 2xl:text-xl">
      <div
        v-for="info in deliveryInfo"
        class="relative px-8 py-4 bg-zinc-900 rounded-xl"
      >
        <i
          class="fa-solid fa-diamond absolute top-0 bottom-0 -left-2 w-fit text-red-500 flex items-center text-2xl"
        ></i>
        <p>{{ info }}</p>
      </div>
    </div>
  </main>
</template>
<style scoped></style>
